In [2]:
import numpy as np
import pandas as pd

In [3]:
label=['a','b','c']
no=[10,20,30]
pd.Series(no)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=no,index=label)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(no,label)

a    10
b    20
c    30
dtype: int64

In [6]:
d={'a':10,'b':20,'c':30,'d':50}
pd.Series(d)

a    10
b    20
c    30
d    50
dtype: int64

In [7]:
pd.Series([sum,len,print])

0      <built-in function sum>
1      <built-in function len>
2    <built-in function print>
dtype: object

In [4]:
data=[1,2,3,4]
index=['india','urope','america','england']
ser1=pd.Series(data,index)

#

In [12]:
ser1['india']

1

ser1

In [5]:
ser1

india      1
urope      2
america    3
england    4
dtype: int64



#

In [25]:
data1=[1,2,3,6]
index1=['india','hai','hii','england']
ser2=pd.Series(data1,index1)

In [26]:
ser1+ser2

america     NaN
england    10.0
hai         NaN
hii         NaN
india       2.0
urope       NaN
dtype: float64

In [7]:
from numpy.random import randn
np.random.seed(101)

In [10]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [30]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df[['W']]

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [35]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [36]:
type(df['W'])

pandas.core.series.Series

In [19]:
df['new']=df['W']+df['W']

In [20]:
df

          W         X         Y         Z       new
A -0.497104 -0.754070 -0.943406  0.484752 -0.994208
B -0.116773  1.901755  0.238127  1.996652 -0.233547
C -0.993263  0.196800 -1.136645  0.000366 -1.986527
D  1.025984 -0.156598 -0.031579  0.649826  2.051968
E  2.154846 -0.610259 -0.755325 -0.346419  4.309693

In [21]:
df.drop('new',axis=1,inplace=True)

In [22]:
df

          W         X         Y         Z
A -0.497104 -0.754070 -0.943406  0.484752
B -0.116773  1.901755  0.238127  1.996652
C -0.993263  0.196800 -1.136645  0.000366
D  1.025984 -0.156598 -0.031579  0.649826
E  2.154846 -0.610259 -0.755325 -0.346419

In [43]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [23]:
df.loc['A']

W   -0.497104
X   -0.754070
Y   -0.943406
Z    0.484752
Name: A, dtype: float64

In [45]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [29]:
df.loc['B','Y']

0.23812695876901832

In [30]:
df>0

       W      X      Y      Z
A  False  False  False   True
B  False   True   True   True
C  False   True  False   True
D   True  False  False   True
E   True  False  False  False

In [49]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [59]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [60]:
index='AA AB AC AD AE'.split()
index

['AA', 'AB', 'AC', 'AD', 'AE']

In [61]:
df['states']=index

In [62]:
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     AA
B  0.651118 -0.319318 -0.848077  0.605965     AB
C -2.018168  0.740122  0.528813 -0.589001     AC
D  0.188695 -0.758872 -0.933237  0.955057     AD
E  0.190794  1.978757  2.605967  0.683509     AE

In [63]:
df.set_index('states')

               W         X         Y         Z
states
AA      2.706850  0.628133  0.907969  0.503826
AB      0.651118 -0.319318 -0.848077  0.605965
AC     -2.018168  0.740122  0.528813 -0.589001
AD      0.188695 -0.758872 -0.933237  0.955057
AE      0.190794  1.978757  2.605967  0.683509

In [64]:
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     AA
B  0.651118 -0.319318 -0.848077  0.605965     AB
C -2.018168  0.740122  0.528813 -0.589001     AC
D  0.188695 -0.758872 -0.933237  0.955057     AD
E  0.190794  1.978757  2.605967  0.683509     AE

In [65]:
df.set_index('states',inplace=True)

In [66]:
df

               W         X         Y         Z
states
AA      2.706850  0.628133  0.907969  0.503826
AB      0.651118 -0.319318 -0.848077  0.605965
AC     -2.018168  0.740122  0.528813 -0.589001
AD      0.188695 -0.758872 -0.933237  0.955057
AE      0.190794  1.978757  2.605967  0.683509

In [67]:
df

               W         X         Y         Z
states
AA      2.706850  0.628133  0.907969  0.503826
AB      0.651118 -0.319318 -0.848077  0.605965
AC     -2.018168  0.740122  0.528813 -0.589001
AD      0.188695 -0.758872 -0.933237  0.955057
AE      0.190794  1.978757  2.605967  0.683509

### index level

In [31]:
outside=['g1','g1','g1','g2','g2','g3']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [32]:
hier_index

MultiIndex(levels=[['g1', 'g2', 'g3'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2], [0, 1, 2, 0, 1, 2]])

In [72]:
df=pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [73]:
df

             A         B
g1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
g2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [74]:
df.loc['g1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [75]:
df.index.names=['group','name']

In [76]:
df

                   A         B
group name
g1    1     0.302665  1.693723
      2    -1.706086 -1.159119
      3    -0.134841  0.390528
g2    1     0.166905  0.184502
      2     0.807706  0.072960
      3     0.638787  0.329646

In [77]:
df.xs('g1')

             A         B
name
1     0.302665  1.693723
2    -1.706086 -1.159119
3    -0.134841  0.390528

In [80]:
df.xs(['g1',1])

A    0.302665
B    1.693723
Name: (g1, 1), dtype: float64

In [82]:
df.xs(1,level='name')

              A         B
group
g1     0.302665  1.693723
g2     0.166905  0.184502

In [11]:
n=int(input("entern no"))
for i in range(0,n):
    for j in range(0,n):
        if i+j<=n/2:
            print(" ",end="")
        if i+j>=n/2+1:
            print("*",end=" ")
    print()

entern no6
   *
  * *
 * * *
* * * *
* * * * *
* * * * * *

In [17]:
import numpy as np
import pandas as pd
df=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})

In [18]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [20]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [23]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [22]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [25]:
df.fillna(value='12')

    A   B  C
0   1   5  1
1   2  12  2
2  12  12  3

In [26]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [27]:
df=pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [33]:
df=pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')
df

E:\anaconda3\lib\site-packages\pandas\io\excel.py:329: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  **kwds)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15